<a href="https://colab.research.google.com/github/bradleysawler/exceltasks/blob/master/ExcelTasks1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
!pip install -q xlrd

In [0]:
# !git clone https://github.com/bradleysawler/exceltasks

In [0]:
ls exceltasks

excel-comp-data_output.xlsx  README.md
excel-comp-data.xlsx         sample-salesv3.xlsx

In [0]:
# https://github.com/seatgeek/fuzzywuzzy
!pip install fuzzywuzzy
!pip install fuzzywuzzy[speedup]
from fuzzywuzzy import fuzz
from fuzzywuzzy import process

Requirement already satisfied: fuzzywuzzy in /usr/local/lib/python3.6/dist-packages (0.17.0)
Requirement already satisfied: fuzzywuzzy[speedup] in /usr/local/lib/python3.6/dist-packages (0.17.0)
Requirement already satisfied: python-levenshtein>=0.12; extra == "speedup" in /usr/local/lib/python3.6/dist-packages (from fuzzywuzzy[speedup]) (0.12.0)
Requirement already satisfied: setuptools in /usr/local/lib/python3.6/dist-packages (from python-levenshtein>=0.12; extra == "speedup"->fuzzywuzzy[speedup]) (41.2.0)

In [0]:
import pandas as pd
import numpy as np
url = 'exceltasks/excel-comp-data.xlsx'
df = pd.read_excel(url)
df.head()

   account                         name  ...     Feb    Mar
0   211829   Kerluke, Koepp and Hilpert  ...   62000  35000
1   320563               Walter-Trantow  ...   45000  35000
2   648336   Bashirian, Kunde and Price  ...  120000  35000
3   109996  D'Amore, Gleichner and Bode  ...  120000  10000
4   121213                Bauch-Goldner  ...  120000  35000

[5 rows x 9 columns]

In [0]:
df["total"] = df["Jan"] + df["Feb"] + df["Mar"]
df.head()

   account                         name  ...    Mar   total
0   211829   Kerluke, Koepp and Hilpert  ...  35000  107000
1   320563               Walter-Trantow  ...  35000  175000
2   648336   Bashirian, Kunde and Price  ...  35000  246000
3   109996  D'Amore, Gleichner and Bode  ...  10000  175000
4   121213                Bauch-Goldner  ...  35000  317000

[5 rows x 10 columns]

In [0]:
df["Jan"].sum(), df["Jan"].mean(),df["Jan"].min(),df["Jan"].max()

(1462000, 97466.66666666667, 10000, 162000)

In [0]:
sum_row = df[["Jan","Feb","Mar","total"]].sum()
sum_row

Jan      1462000
Feb      1507000
Mar       717000
total    3686000
dtype: int64

In [0]:
df_sum = pd.DataFrame(data = sum_row).T
df_sum

       Jan      Feb     Mar    total
0  1462000  1507000  717000  3686000

In [0]:
df_sum = df_sum.reindex(columns = df.columns)
df_sum

   account  name  street  city  ...      Jan      Feb     Mar    total
0      NaN   NaN     NaN   NaN  ...  1462000  1507000  717000  3686000

[1 rows x 10 columns]

In [0]:
df_final = df.append(df_sum)
df_final.tail()

     account                          name  ...     Mar    total
11  231907.0                    Hahn-Moore  ...  162000   322000
12  242368.0  Frami, Anderson and Donnelly  ...   35000   317000
13  268755.0                   Walsh-Haley  ...   35000   210000
14  273274.0                 McDermott PLC  ...   70000   340000
0        NaN                           NaN  ...  717000  3686000

[5 rows x 10 columns]

In [0]:
state_to_code = {"VERMONT": "VT", "GEORGIA": "GA", "IOWA": "IA", "Armed Forces Pacific": "AP", "GUAM": "GU",
                 "KANSAS": "KS", "FLORIDA": "FL", "AMERICAN SAMOA": "AS", "NORTH CAROLINA": "NC", "HAWAII": "HI",
                 "NEW YORK": "NY", "CALIFORNIA": "CA", "ALABAMA": "AL", "IDAHO": "ID", "FEDERATED STATES OF MICRONESIA": "FM",
                 "Armed Forces Americas": "AA", "DELAWARE": "DE", "ALASKA": "AK", "ILLINOIS": "IL",
                 "Armed Forces Africa": "AE", "SOUTH DAKOTA": "SD", "CONNECTICUT": "CT", "MONTANA": "MT", "MASSACHUSETTS": "MA",
                 "PUERTO RICO": "PR", "Armed Forces Canada": "AE", "NEW HAMPSHIRE": "NH", "MARYLAND": "MD", "NEW MEXICO": "NM",
                 "MISSISSIPPI": "MS", "TENNESSEE": "TN", "PALAU": "PW", "COLORADO": "CO", "Armed Forces Middle East": "AE",
                 "NEW JERSEY": "NJ", "UTAH": "UT", "MICHIGAN": "MI", "WEST VIRGINIA": "WV", "WASHINGTON": "WA",
                 "MINNESOTA": "MN", "OREGON": "OR", "VIRGINIA": "VA", "VIRGIN ISLANDS": "VI", "MARSHALL ISLANDS": "MH",
                 "WYOMING": "WY", "OHIO": "OH", "SOUTH CAROLINA": "SC", "INDIANA": "IN", "NEVADA": "NV", "LOUISIANA": "LA",
                 "NORTHERN MARIANA ISLANDS": "MP", "NEBRASKA": "NE", "ARIZONA": "AZ", "WISCONSIN": "WI", "NORTH DAKOTA": "ND",
                 "Armed Forces Europe": "AE", "PENNSYLVANIA": "PA", "OKLAHOMA": "OK", "KENTUCKY": "KY", "RHODE ISLAND": "RI",
                 "DISTRICT OF COLUMBIA": "DC", "ARKANSAS": "AR", "MISSOURI": "MO", "TEXAS": "TX", "MAINE": "ME"}

In [0]:
def convert_state(row):
    abbrev = process.extractOne(str(row["state"]),choices=state_to_code.keys(),score_cutoff=80)
    if abbrev:
        return state_to_code[abbrev[0]]
    return np.nan

In [0]:
df_final.insert(6, "abbrev", np.nan)
df_final.head()

    account                         name  ...    Mar   total
0  211829.0   Kerluke, Koepp and Hilpert  ...  35000  107000
1  320563.0               Walter-Trantow  ...  35000  175000
2  648336.0   Bashirian, Kunde and Price  ...  35000  246000
3  109996.0  D'Amore, Gleichner and Bode  ...  10000  175000
4  121213.0                Bauch-Goldner  ...  35000  317000

[5 rows x 11 columns]

In [0]:
df_final['abbrev'] = df_final.apply(convert_state, axis=1)
df_final.tail()

     account                          name  ...     Mar    total
11  231907.0                    Hahn-Moore  ...  162000   322000
12  242368.0  Frami, Anderson and Donnelly  ...   35000   317000
13  268755.0                   Walsh-Haley  ...   35000   210000
14  273274.0                 McDermott PLC  ...   70000   340000
0        NaN                           NaN  ...  717000  3686000

[5 rows x 11 columns]

# Subtotals

# New Section

In [0]:
df_sub = df_final[["abbrev","Jan","Feb","Mar","total"]].groupby('abbrev').sum()
df_sub

           Jan     Feb     Mar   total
abbrev
AR      150000  120000   35000  305000
CA      162000  120000   35000  317000
DE      150000  120000   70000  340000
IA      253000  240000   70000  563000
ID       70000  120000   35000  225000
ME       45000  120000   10000  175000
MS       62000  120000   70000  252000
NC       95000   45000   35000  175000
ND      150000   10000  162000  322000
PA       70000   95000   35000  200000
RI      200000  215000   70000  485000
TN       45000  120000   55000  220000
TX       10000   62000   35000  107000

In [0]:
sum_rows = df_sub[['Jan', 'Feb', 'Mar', 'total']].sum()
sum_rows

Jan      1462000
Feb      1507000
Mar       717000
total    3686000
dtype: int64

In [0]:
df_sub_sum = pd.DataFrame(data=sum_row).T
df_sub_sum

       Jan      Feb     Mar    total
0  1462000  1507000  717000  3686000

In [0]:
df_sub_sum = df_sub_sum.applymap(money)
df_sub_sum

          Jan         Feb       Mar       total
0  $1,462,000  $1,507,000  $717,000  $3,686,000

In [0]:
df_sub_sum = df_sub_sum.reindex(columns = df_sub.columns)
df_sub_sum

          Jan         Feb       Mar       total
0  $1,462,000  $1,507,000  $717,000  $3,686,000

In [0]:
df_final = formatted_df.append(df_sub_sum)
df_final

           Jan         Feb       Mar       total
AR    $150,000    $120,000   $35,000    $305,000
CA    $162,000    $120,000   $35,000    $317,000
DE    $150,000    $120,000   $70,000    $340,000
IA    $253,000    $240,000   $70,000    $563,000
ID     $70,000    $120,000   $35,000    $225,000
ME     $45,000    $120,000   $10,000    $175,000
MS     $62,000    $120,000   $70,000    $252,000
NC     $95,000     $45,000   $35,000    $175,000
ND    $150,000     $10,000  $162,000    $322,000
PA     $70,000     $95,000   $35,000    $200,000
RI    $200,000    $215,000   $70,000    $485,000
TN     $45,000    $120,000   $55,000    $220,000
TX     $10,000     $62,000   $35,000    $107,000
0   $1,462,000  $1,507,000  $717,000  $3,686,000

In [0]:
df_final = df_final.rename(index= {0 : 'Total'})
df_final

              Jan         Feb       Mar       total
AR       $150,000    $120,000   $35,000    $305,000
CA       $162,000    $120,000   $35,000    $317,000
DE       $150,000    $120,000   $70,000    $340,000
IA       $253,000    $240,000   $70,000    $563,000
ID        $70,000    $120,000   $35,000    $225,000
ME        $45,000    $120,000   $10,000    $175,000
MS        $62,000    $120,000   $70,000    $252,000
NC        $95,000     $45,000   $35,000    $175,000
ND       $150,000     $10,000  $162,000    $322,000
PA        $70,000     $95,000   $35,000    $200,000
RI       $200,000    $215,000   $70,000    $485,000
TN        $45,000    $120,000   $55,000    $220,000
TX        $10,000     $62,000   $35,000    $107,000
Total  $1,462,000  $1,507,000  $717,000  $3,686,000

In [0]:
urlo = 'exceltasks/excel-comp-data_output.xlsx'
df_final.to_excel(urlo)